# OnDuplicateTypeNamesFound Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDuplicateTypeNamesHandler..::..OnDuplicateTypeNamesFound Method
IDuplicateTypeNamesHandler Interface See Also
---
Called when the destination document contains types with the same names as the types being copied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
DuplicateTypeAction OnDuplicateTypeNamesFound(
	DuplicateTypeNamesHandlerArgs args
)
```

Visual Basic
---
```text
Function OnDuplicateTypeNamesFound ( _
	args As DuplicateTypeNamesHandlerArgs _
) As DuplicateTypeAction
```

Visual C++
---
```text
DuplicateTypeAction OnDuplicateTypeNamesFound(
	DuplicateTypeNamesHandlerArgs^ args
)
```

# ### Parameters
args
    Type: Autodesk.Revit.DB..::..DuplicateTypeNamesHandlerArgs The information about the types with duplicate names.
# ### Return Value
The action to be taken: copy only types with unique names or cancel the operation.
# See Also
IDuplicateTypeNamesHandler Interface
Autodesk.Revit.DB Namespace